/**
 * 面试模块 ************************************************************
 */
// 面试典数组
const DictionarySidebar = [
  {
    text: '📔 面试题典',
    collapsible: true,
    items: [
      {
        text: 'Javascript',
        collapsible: true,
        items: [
          {
            text: '(a==1&&a==2&&a==3)',
            link: '/面试鸭/面试典/js/(a==1&&a==2&&a==3)',
          },
          {
            text: '数组方法手写原理',
            link: '/面试鸭/面试典/js/数组方法手写原理',
          },
          {
            text: '关于forEach使用break跳出循环',
            link: '/面试鸭/面试典/js/关于forEach使用break跳出循环',
          },
          { text: '手写封装AJAX', link: '/面试鸭/面试典/js/手写封装AJAX' },
          { text: '数组去重', link: '/面试鸭/面试典/js/数组去重' },
          { text: 'js执行顺序', link: '/面试鸭/面试典/js/js执行顺序' },
        ],
      },
      {
        text: '项目',
        collapsible: true,
        items: [
          {
            text: '前端面试项目亮点和难点',
            link: '/面试鸭/面试典/project/前端面试项目亮点和难点',
          },
        ],
      },
    ],
  },
]
export default DictionarySidebar
