// 学而时习之 - 实操训练数组
const StudyOperateeSidebar = [
  {
    text: '⚙ 功能操作与实现',
    collapsible: true,
    collapsed: true,
    items: [
      {
        text: 'Vue项目权限控制',
        link: '/study/operate/功能操作与实现/Vue项目权限控制',
      },
      {
        text: '摆脱手动依赖引入，自动引入依赖',
        link: '/study/operate/功能操作与实现/摆脱手动依赖引入，自动引入依赖',
      },
      {
        text: '操作内嵌ifrname与传递消息',
        link: '/study/operate/功能操作与实现/操作内嵌ifrname与传递消息',
      },
      {
        text: '从一个需求出发如何更优雅写代码',
        link: '/study/operate/功能操作与实现/从一个需求出发如何更优雅写代码',
      },
      {
        text: '富文本编辑器',
        link: '/study/operate/功能操作与实现/富文本编辑器',
      },
      {
        text: '前端操作excel与word',
        link: '/study/operate/功能操作与实现/前端操作excel与word',
      },
      {
        text: '前端文件上传与相关操作',
        link: '/study/operate/功能操作与实现/前端文件上传与相关操作',
      },
      {
        text: '前端下载后端传输的文件',
        link: '/study/operate/功能操作与实现/前端下载后端传输的文件',
      },
      {
        text: '移动端大屏端布局适配',
        link: '/study/operate/功能操作与实现/移动端大屏端布局适配',
      },
    ],
  },
  {
    text: '🎁 组件封装与二开',
    collapsible: true,
    collapsed: true,
    items: [
      {
        text: 'vue重复小组件处理经验',
        link: '/study/operate/组件封装与二开/vue重复小组件处理经验',
      },
      {
        text: 'vue组件设计技巧',
        link: '/study/operate/组件封装与二开/vue组件设计技巧',
      },
      {
        text: '对话框弹窗组件',
        link: '/study/operate/组件封装与二开/对话框弹窗组件',
      },
      {
        text: '输入框组件封装',
        link: '/study/operate/组件封装与二开/输入框组件封装',
      },
      {
        text: '通过el-calendar实现业务',
        link: '/study/operate/组件封装与二开/通过el-calendar实现业务',
      },
      {
        text: '通过el-select实现多个省略学习如何改造第三方组件满足自己的要求',
        link: '/study/operate/组件封装与二开/通过el-select实现多个省略学习如何改造第三方组件满足自己的要求',
      },
      {
        text: '通过el-table实现多数据完美无限滚动效果',
        link: '/study/operate/组件封装与二开/通过el-table实现多数据完美无限滚动效果',
      },
      {
        text: '页码列表组件封装思路',
        link: '/study/operate/组件封装与二开/页码列表组件封装思路',
      },
      {
        text: '组件库搭建',
        link: '/study/operate/组件封装与二开/组件库搭建',
      },
    ],
  },
  {
    text: '🗑 返回',
    link: '/study/',
  },
]
export default StudyOperateeSidebar
